<template>
    <el-container id="app">
        <el-main class="main-content">
            <div class="box-card">
                <div class="title">
                    <router-link class="first-title" to="detail">没什么了不起的</router-link>
                    <el-text class="second-title">作者：Rosa</el-text>
                    <el-text class="second-title">日期：2019-04-12 12:10:11</el-text>
                </div>
                <div class="text item">
                    没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了...
                    没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了...
                    没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了...
                    没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了...
                    没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了...
                    没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了...
                    没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了不起的没什么了...
                    ...
                </div>
                <div class="content-footer">
                    <div class="left">
                        <el-text class="history-title">上一篇：<router-link to="detail" class="np-title">《微习惯：简单到不可能失败的自我管理法则》</router-link></el-text>
                    </div>
                    <div class="right">
                        <el-text class="history-title">下一篇：<router-link to="detail" class="np-title">《如何衡量自己的人生》</router-link></el-text>
                    </div>
                </div>
            </div>

        </el-main>

        

    </el-container>
    
</template>

<script>
export default {
    data(){
        return {
           author: "Rolly"
        };
    },
    methods: {
        
    }
};
</script>

<style scoped>
.el-container {
    width: 100%;
}
.main-content {
    margin-left: 50px;
}

.title {
    padding-bottom: 10px;
    border-bottom: 1px solid #ccc;
}

.title .first-title{
    color: #222; 
    font-size: 30px; 
}

.title .second-title{
    margin-left: 15px; 
    color: #838b8c; 
    font-size: 12px;
}


.box-card {
    border-radius: 5px;
}

.text {
    font-size: 14px;
    text-indent: 2rem;
}

.item {
    padding: 28px 18px;
}

.content-footer {
    margin-top: 50px;
}
.history-title {
    color: rgb(98, 97, 97);
}

.content-footer .left {
    float: left;
}

.content-footer .right {
    float: right;
}

.np-title {
    color: #409EFF;
}

  
</style>
